/***************************************************************************//**
  @file     App.c
  @brief    Application functions
  @author   Grupo 1
 ******************************************************************************/

/*******************************************************************************
 * INCLUDE HEADER FILES
 ******************************************************************************/

#include <stdio.h>
#include <string.h>

#include "os.h"
#include "DRV_DataTransmission.h"
#include "DRV_Board.h"
#include "DRV_Timers.h"

/*******************************************************************************
 * CONSTANT AND MACRO DEFINITIONS USING #DEFINE
 ******************************************************************************/


/*******************************************************************************
 * ENUMERATIONS AND STRUCTURES AND TYPEDEFS
 ******************************************************************************/

/*******************************************************************************
 * ROM CONST VARIABLES WITH FILE LEVEL SCOPE
 ******************************************************************************/


/*******************************************************************************
 * FUNCTION PROTOTYPES FOR PRIVATE FUNCTIONS WITH FILE LEVEL SCOPE
 ******************************************************************************/


/*******************************************************************************
 * STATIC VARIABLES AND CONST VARIABLES WITH FILE LEVEL SCOPE
 ******************************************************************************/

static OS_Q* floorMsgQPointer;

/*******************************************************************************
 *******************************************************************************
                        GLOBAL FUNCTION DEFINITIONS
 *******************************************************************************
 ******************************************************************************/

/* Función que se llama 1 vez, al comienzo del programa */
void Transmission_Init (OS_Q* msgq)
{
	initBoard();
	initDataTransmission();

	floorMsgQPointer = msgq;
}

/* Función que se llama constantemente en un ciclo infinito */
void Transmission_Run (void)
{
	OS_ERR os_err;

	void* p_msg;
	OS_MSG_SIZE msg_size;

	p_msg = OSQPend(floorMsgQPointer, 0, OS_OPT_PEND_BLOCKING, &msg_size, NULL, &os_err);

	sendData(((uint16_t*)p_msg)[0], ((uint16_t*)p_msg)[1], ((uint16_t*)p_msg)[2]);

	/*

	if(responseReady()){
		if(getResponse() == KEEP_ALIVE_OK){
			setLED(BLUE, 1);
		}
	}
	OSTimeDlyHMSM(0, 0, 0, 500, OS_OPT_TIME_HMSM_STRICT, &os_err);
	sendKeepAlive();
	setLED(BLUE, 0);
	OSTimeDlyHMSM(0, 0, 0, 500, OS_OPT_TIME_HMSM_STRICT, &os_err);*/
}

/*******************************************************************************
 *******************************************************************************
                        LOCAL FUNCTION DEFINITIONS
 *******************************************************************************
 ******************************************************************************/


/*******************************************************************************
 ******************************************************************************/
